; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v1)
             (pred_12 ?v13 ?v10)
             (pred_9 ?v11 ?v10)
             (pred_11 ?v5 ?v11 )
	     (pred_8 ?v11)
             (pred_7 ?v3)
             (pred_2 ?v13)
             (pred_4 ?v10)
             (pred_3 ?v11)
             (pred_5 ?v13)
             (pred_1 ?v11)
             (pred_10 ))



(:action op_4
:parameters (?v2 ?v6 ?v12 ?v4)
:precondition (and (pred_7 ?v2) (pred_7 ?v6) (pred_2 ?v12) (pred_4 ?v4)
          (pred_6 ?v2 ?v6) (pred_12 ?v12 ?v4)
                   (pred_9 ?v6 ?v4) (pred_8 ?v2) 
                   (pred_3 ?v6) (pred_5 ?v12))
:effect (and  (pred_1 ?v6) (not (pred_3 ?v6))))


(:action op_3
:parameters (?v2 ?v8)
:precondition (and (pred_7 ?v2) (pred_7 ?v8)
               (pred_8 ?v2) (pred_6 ?v2 ?v8) (pred_1 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v2))))

(:action op_1
:parameters (?v2 ?v12)
:precondition (and (pred_7 ?v2) (pred_2 ?v12) 
                  (pred_8 ?v2) (pred_11 ?v12 ?v2) (pred_10 ))
:effect (and (pred_5 ?v12)
   (not (pred_11 ?v12 ?v2)) (not (pred_10 ))))


(:action op_2
:parameters (?v2 ?v9 ?v7)
:precondition (and (pred_7 ?v2) (pred_2 ?v9) (pred_2 ?v7)
                  (pred_8 ?v2) (pred_5 ?v7) (pred_11 ?v9 ?v2))
:effect (and (pred_5 ?v9) (pred_11 ?v7 ?v2)
        (not (pred_5 ?v7)) (not (pred_11 ?v9 ?v2))))

(:action op_5
:parameters (?v2 ?v12)
:precondition (and (pred_7 ?v2) (pred_2 ?v12) 
                  (pred_8 ?v2) (pred_5 ?v12))
:effect (and (pred_10 ) (pred_11 ?v12 ?v2) (not (pred_5 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_06 obj_02 obj_11 obj_15 obj_21 obj_20 obj_13 obj_04 obj_07 obj_18 obj_16 obj_09 obj_19 obj_10 obj_08
    obj_05 obj_14
    obj_01 obj_03 obj_12
    )

    (:init
       (pred_10)

       (pred_7 obj_17)
       (pred_7 obj_06)
       (pred_7 obj_02)
       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_21)
       (pred_7 obj_20)
       (pred_7 obj_13)
       (pred_7 obj_04)
       (pred_7 obj_07)
       (pred_7 obj_18)
       (pred_7 obj_16)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_10)
       (pred_7 obj_08)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_2 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_12)

       (pred_6 obj_17 obj_15)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_21)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_20)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_21 obj_15)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_20 obj_21)
       (pred_6 obj_13 obj_16)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_13)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_10)
       (pred_3 obj_16)
       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_9  obj_16 obj_05)
       (pred_9  obj_21 obj_14)
       (pred_9  obj_07 obj_14)
       (pred_1 obj_17)
       (pred_1 obj_06)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_15)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_18)
       (pred_1 obj_09)
       (pred_1 obj_19)
       (pred_1 obj_10)
       (pred_1 obj_08)

       (pred_12  obj_01 obj_05)
       (pred_12  obj_03 obj_14)
       (pred_12  obj_12 obj_05)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_12 obj_18)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_11 obj_01 obj_10)
       (pred_11 obj_12 obj_13)
    ))
(:constraints
  (always (not (pred_8 obj_20)))
)
)

; plan
1. (op_3 obj_13 obj_11)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_11)
   goals met: 0 of 2
2. (op_3 obj_11 obj_02)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_02)
   goals met: 0 of 2
3. (op_3 obj_02 obj_06)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_06)
   goals met: 0 of 2
4. (op_3 obj_06 obj_17)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_17)
   goals met: 0 of 2
5. (op_3 obj_17 obj_15)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_15)
   goals met: 0 of 2
6. (op_3 obj_15 obj_04)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_04)
   goals met: 0 of 2
7. (op_3 obj_04 obj_09)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_09)
   goals met: 0 of 2
8. (op_3 obj_09 obj_19)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_19)
   goals met: 0 of 2
9. (op_1 obj_19 obj_01)
   deleted: (pred_11 obj_01 obj_19) (pred_10)
   added: (pred_5 obj_01)
   goals met: 0 of 2
10. (op_3 obj_19 obj_10)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_10)
   goals met: 0 of 2
11. (op_2 obj_10 obj_03 obj_01)
   deleted: (pred_5 obj_01) (pred_11 obj_03 obj_10)
   added: (pred_5 obj_03) (pred_11 obj_01 obj_10)
   goals met: 1 of 2
12. (op_3 obj_10 obj_18)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_18)
   goals met: 1 of 2
13. (op_2 obj_18 obj_12 obj_03)
   deleted: (pred_5 obj_03) (pred_11 obj_12 obj_18)
   added: (pred_5 obj_12) (pred_11 obj_03 obj_18)
   goals met: 1 of 2
14. (op_4 obj_18 obj_16 obj_12 obj_05)
   deleted: (pred_3 obj_16)
   added: (pred_1 obj_16)
   goals met: 1 of 2
15. (op_3 obj_18 obj_16)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_16)
   goals met: 1 of 2
16. (op_3 obj_16 obj_13)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_13)
   goals met: 1 of 2
17. (op_5 obj_13 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_10) (pred_11 obj_12 obj_13)
   goals met: 2 of 2
